Repository: andrebian/wordpress-importer
Catalog: languages/wordpress-importer-*.po
Languages: pt_br

source: There was an error when reading this WXR file
pt_br: Houve um erro ao ler o arquivo WXR

source: Details are shown above. The importer will now try again with a different parser...
pt_br: Exibindo detalhes abaixo. O importador irá tentar novamente a partir de outra forma ...

source: This does not appear to be a WXR file, missing/invalid WXR version number
pt_br: O arquivo não parece ser um arquivo WXR válido, número de versão não localizado ou inválido

source: Sorry, there has been an error.
pt_br: Desculpe, houve um erro.

source: The file does not exist, please try again.
pt_br: O arquivo não existe, por favor tente novamente

source: All done.
pt_br: Concluído

source: Have fun!
pt_br: Divirta-se

source: Remember to update the passwords and roles of imported users.
pt_br: Lembre-se de atualizar as senhas e papéis dos usuários importados.

source: This WXR file (version %s) may not be supported by this version of the importer. Please consider updating.
pt_br: Este arquivo WXR (versão %s) não é suportado pelo importador. Por favor considere a atualização.

source: Failed to import author %s. Their posts will be attributed to the current user.
pt_br: Falha ao importar o autor %s. Seus posts serão atribuídos ao usuário atual.

source: Assign Authors
pt_br: Atribuir autores

source: To make it easier for you to edit and save the imported content, you may want to reassign the author of the imported item to an existing user of this site. For example, you may want to import all the entries as <code>admin</code>s entries.
pt_br: Para facilitar a inclusão e edição do conteúdo importado, você pode desejar reatribuir o autor do item importado para um usuário existente deste site. Por exemplo: você pode querer importar todos os posts como posts do <code>admin</code>.

source: If a new user is created by WordPress, a new password will be randomly generated and the new user&#8217;s role will be set as %s. Manually changing the new user&#8217;s details will be necessary.
pt_br: Se um novo usuário é criado pelo Wordpress, uma nova senha será dinamicamente gerada e a função do usuário será setada como %s. A Alteração manual do novo usuário será necessária.

source: Import Attachments
pt_br: Importar anexos

source: Download and import file attachments
pt_br: Baixar e importar arquivos anexados

source: Submit
pt_br: Realizar importação

source: Import author:
pt_br: Importar autor:

source: or create new user with login name:
pt_br: ou criar novo usuário com o login:

source: as a new user:
pt_br: como um novo usuário:

source: assign posts to an existing user:
pt_br: atribuir posts a um usuário existente:

source: or assign posts to an existing user:
pt_br: ou atribuir posts a um usuário existente:

source: - Select -
pt_br: - Selecione -

source: Failed to create new user for %s. Their posts will be attributed to the current user.
pt_br: Falha ao criar o novo usuário %s. Seus posts serão atribuídos ao usuário atual.

source: Failed to import category %s
pt_br: Falha ao importar categoria %s

source: Failed to import post tag %s
pt_br: Falha ao importar tag %s de posts

source: Failed to import %s %s
pt_br: Falha ao importar %s %s

source: Failed to import &#8220;%s&#8221;: Invalid post type %s
pt_br: Falha ao importar &#8220;%s&#8221;: Tipo de post &#8220;%s&#8221; inválido

source: %s &#8220;%s&#8221; already exists.
pt_br: %s &#8220;%s&#8221; existe atualmente.

source: Failed to import %s &#8220;%s&#8221;
pt_br: Falha ao importar %s &#8220;%s&#8221;

source: Menu item skipped due to missing menu slug
pt_br: Item do menu ignorado por não conter slug

source: Menu item skipped due to invalid menu slug: %s
pt_br: Item do menu ignorado por não conter o slug: %s

source: Fetching attachments is not enabled
pt_br: Busca por anexos não está habilitada

source: Invalid file type
pt_br: Tipo de arquivo inválido

source: Remote server did not respond
pt_br: Servidor remoto não responde

source: Remote server returned error response %1$d %2$s
pt_br: Servidor remoto retornou o seguinte erro: %1$d %2$s

source: Remote file is incorrect size
pt_br: Arquivo remoto possui tamanho incorreto

source: Zero size file downloaded
pt_br: Arquivo vazio baixado

source: Remote file is too large, limit is %s
pt_br: Arquivo remoto é muito grande, o limite é %s

source: Import WordPress
pt_br: Importação do Wordpress

source: A new version of this importer is available. Please update to version %s to ensure compatibility with newer export files.
pt_br: Uma nova versão deste importador está disponível. Por favor atualize para a versão %s para garantir compatibilidade com os novos arquivos exportados.

source: Howdy! Upload your WordPress eXtended RSS (WXR) file and we&#8217;ll import the posts, pages, comments, custom fields, categories, and tags into this site.
pt_br: Olá! Carregue seu arquivo Wordpress eXtended RSS (WXR) e importaremos os posts, páginas, comentários, campos personalizados, categorias e tags para este site.

source: Choose a WXR (.xml) file to upload, then click Upload file and import.
pt_br: Selecione um arquivo WXR (.xml) para carregar e clique em 'Fazer upload de arquivo e importar'.

source: Import <strong>posts, pages, comments, custom fields, categories, and tags</strong> from a WordPress export file.
pt_br: Importe <strong>posts, páginas, comentários, campos personalizados, categorias e tags</strong> de um arquivo de exportação do Wordpress.

source: WordPress Importer
pt_br: Importador do Wordpress

source: Import posts, pages, comments, custom fields, categories, tags and more from a WordPress export file.
pt_br: Importe posts, páginas, comentários, campos personalizados, categorias e tags de um arquivo de exportação do Wordpress.
